Service - Income Tax/sample messages/file_request_ir8_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r8:fileRequest xmlns:r8="urn:www.ird.govt.nz/GWS:types/ReturnIR8.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">050700461</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2023-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>8</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r8:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r8:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:grossResRentalIncome>700.00</ic:grossResRentalIncome>
                                    <ic:netBrightlineProfits>700.00</ic:netBrightlineProfits>
                                    <ic:otherResIncome>700.00</ic:otherResIncome>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r8:residentialRentalIncome>
                                <r8:propertyInterestLimitation>
                                    <ic:totalInterest>1000.00</ic:totalInterest>
                                    <ic:interestExpenseClaimed>1000.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>false</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>false</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>false</ic:loansDrawnDown>
                                        <ic:newBuildExemption>false</ic:newBuildExemption>
                                        <ic:developmentExemption>false</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>false</ic:emergencyTransitionalSocialCouncil>
                                        <ic:buildToRentExclusion>true</ic:buildToRentExclusion>
                                    </ic:interestExpenseClaimedReason>
                                </r8:propertyInterestLimitation>
                                <r8:saleOfProperty>0.00</r8:saleOfProperty>
                                <r8:grossInterest>1000.00</r8:grossInterest>
                                <r8:grossDividends>1000.00</r8:grossDividends>
                                <r8:maoriAuthorityDistributions>1000.00</r8:maoriAuthorityDistributions>
                                <r8:netRentalIncome>1000.00</r8:netRentalIncome>
                                <r8:netTradingIncome>1000.00</r8:netTradingIncome>
                                <r8:otherIncome>1000.00</r8:otherIncome>
                                <r8:adjustmentsOutsideFinancialAccounts>1000.00</r8:adjustmentsOutsideFinancialAccounts>
                                <r8:donationDeductions>1000.00</r8:donationDeductions>
                                <r8:lossesBroughtForward>0.00</r8:lossesBroughtForward>
                                <r8:lossCarriedBackPriorYear>0.00</r8:lossCarriedBackPriorYear>
                                <r8:totalTaxableIncome>6000.00</r8:totalTaxableIncome>
                                <r8:taxOnTaxableIncome>1050.00</r8:taxOnTaxableIncome>
                                <r8:overseasTaxPaid>875.00</r8:overseasTaxPaid>
                                <r8:dividendImputationCredits>1000.00</r8:dividendImputationCredits>
                                <r8:researchAndDevelopment>
                                    <ic:creditBroughtForward>0.00</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0.00</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0.00</ic:refundableCredit>
                                </r8:researchAndDevelopment>
                                <r8:totalRWTDeducted>1000.00</r8:totalRWTDeducted>
                                <r8:rlwtCredit>0.00</r8:rlwtCredit>
                                <r8:otherTaxCredits>1000.00</r8:otherTaxCredits>
                                <r8:residualIncomeTax>-2000.00</r8:residualIncomeTax>
                                <r8:overpaymentProvisionalTax>0.00</r8:overpaymentProvisionalTax>
                                <r8:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2019-03-01</ic:provisionalTaxStartDate>
                                </r8:provisionalTax>
                                <r8:disclosureOfForeignInterestRequired>true</r8:disclosureOfForeignInterestRequired>
                            </rc:formFields>
                        </rc:fileBody>
                    </r8:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>